### 2021_09_16

## pandas basic 실습

In [2]:
myfood = ['banana', 'apple', 'candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])

banana
apple
candy

In [3]:
for item in myfood :
    print(item)

banana
apple
candy

In [5]:
dict1 = {"one" : "하나", "two" : "둘", "three" : "셋"}
dict2 = {1 : "하나", 2 : "둘", 3 : "셋"}
dict3 = {"col" : [1, 2, 3], "col2" : ['a', 'b', 'c']}

In [6]:
print(dict1)
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col': [1, 2, 3], 'col2': ['a', 'b', 'c']}

### pandas module 불러오기

In [7]:
import pandas as pd

In [9]:
print("pandas version :", pd.__version__)

pandas version : 1.3.2

In [11]:
from pandas import Series, DataFrame

In [12]:
## ___ = Series([1000, 14000, 3000, 30000, 10000])
score = Series([1000, 14000, 3000, 30000, 10000])
print(score)

0     1000
1    14000
2     3000
3    30000
4    10000
dtype: int64

In [13]:
type(score)

pandas.core.series.Series

In [17]:
# Series 인덱스 확인
print(score.index)
# 인덱스를 리스트 자료형으로 변경 후, 확인하기
print(list(score.index))
# Series 값 확인
print(score.values)

# score type 확인
print(type(score.index))
print(type(list(score.index)))
print(type(score.values))

RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000 30000 10000]
<class 'pandas.core.indexes.range.RangeIndex'>
<class 'list'>
<class 'numpy.ndarray'>

## 판다스 시리즈 인덱스 지정

In [19]:
# 인덱스(index) 속성 이용
score = Series([1000, 14000, 3000], index = ['2019-05-01', '2019-05-02', '2019-05-03'])
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [21]:
# 실습 1-1 Series를 만들기(자료형으로 만들기)
score = Series(['a', 'b', 'c'])
print(score)
# 실습 1-2 index 넣어보기
score_idx = Series(['a', 'b', 'c'], index = ['2021-09-16', '2021-09-17', '2021-09-18'])
print(score_idx)

0    a
1    b
2    c
dtype: object
2021-09-16    a
2021-09-17    b
2021-09-18    c
dtype: object

In [22]:
for idx in score.index :
    print(idx)

0
1
2

In [23]:
for value in score.values :
    print(value)

a
b
c

In [25]:
# date_range를 이용한 인덱스 지정
idx = pd.date_range(start = "2021-01-01", end = "2021-01-03").tolist()

score_idx = Series(['a', 'b', 'c'], index = idx)

print(score_idx)

2021-01-01    a
2021-01-02    b
2021-01-03    c
dtype: object

### 두 팀의 팀점수 합산해보기
* 길동팀의 3일간의 점수와 toto팀의 3일간의 점수

In [26]:
gildong = Series([1500, 3000, 2500], index = ['2019-05-01', '2019-05-02', '2019-05-03'])
toto = Series([3000, 3000, 2000], index = ['2019-05-01', '2019-05-03', '2019-05-02'])
print(gildong + toto)

2019-05-01    4500
2019-05-02    5000
2019-05-03    5500
dtype: int64

In [28]:
date_idx = pd.date_range(start = "2021-01-01", end = "2021-01-03").tolist()
A = Series([1000, 1000, 1000], index = date_idx)
B = Series([2000, 2000, 2000], index = date_idx)
print(A + B)

2021-01-01    3000
2021-01-02    3000
2021-01-03    3000
dtype: int64

### 데이터는 3개월 날짜 1부터 90까지 idx를 3개월 날짜로 지정하기 (1월~3월)

In [29]:
d_idx = pd.date_range(start = "2021-01-01", end = "2021-03-31").tolist()
date = Series(range(1, 91), index = d_idx)
print(date)

2021-01-01     1
2021-01-02     2
2021-01-03     3
2021-01-04     4
2021-01-05     5
              ..
2021-03-27    86
2021-03-28    87
2021-03-29    88
2021-03-30    89
2021-03-31    90
Length: 90, dtype: int64

## 데이터 프레임의 이해
* 데이터 프레임의 객체를 생성하는 가장 간단한 방법은 딕셔너리를 이용하는 방법
* 데이터 프레임은 Series의 결합으로 이루어진 것으로 생각할 수 있음.
* pandas의 대표적인 기본 자료형이다.
* Seaborn 데이터(load_dataset() - pandas)
    * seaborn에 들어가는 기본적인 데이터 자료형이 pandas이다.
* plotly에서도 pandas 호환
* DataFrame 함수를 이용하여 객체 생성이 가능하다.

In [30]:
from pandas import DataFrame

In [33]:
dat = {'col1' : [1, 2, 3, 4],
      'col2' : [10, 20, 30, 40],
      'col3' : ['A', 'B', 'C', 'D']}
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [35]:
idx_date = pd.date_range(start = "2021-09-01", end = "2021-09-04").tolist()
dat = {'col1' : [1, 2, 3, 4],
      'col2' : [10, 20, 30, 40],
      'col3' : ['A', 'B', 'C', 'D']}
df = DataFrame(dat, index = idx_date)
df

            col1  col2 col3
2021-09-01     1    10    A
2021-09-02     2    20    B
2021-09-03     3    30    C
2021-09-04     4    40    D

### 네 팀의 5일간의 팀별 점수
* 팀은 toto, gildong, apple, catanddog 팀이다.

In [144]:
from pandas import DataFrame

team_score = {"toto" : [1500, 3000, 5000, 7000, 5500],
             "apple" : [4000, 5000, 6000, 5500, 4500],
             "gildong" : [2000, 2500, 3000, 4000, 3000],
             "catanddog" : [7000, 5000, 3000, 5000, 4000]}

team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

### toto팀의 점수 확인
* 팀별 컬럼명을 이용하여 접근이 가능하다.

In [63]:
team_df['toto']

0    1500
1    3000
2    5000
3    7000
4    5500
Name: toto, dtype: int64

In [64]:
team_df[['toto']]

   toto
0  1500
1  3000
2  5000
3  7000
4  5500

In [41]:
# 두 개의 열 선택 - 잘못된 선택
# team_df['catanddog', 'toto']

In [42]:
# 두 개의 열 선택 - 해결
team_df[['catanddog', 'toto']]

   catanddog  toto
0       7000  1500
1       5000  3000
2       3000  5000
3       5000  7000
4       4000  5500

In [43]:
# 두 개의 열 선택
# team_df.loc[]
# team_df.iloc[]

### loc와 iloc를 이용한 접근
* loc는 데이터 프레임의 컬럼명(인덱스)를 사용하여 데이터를 추출한다.
* iloc는 데이터 프레임의 데이터 순서(번호)를 사용하여 데이터를 추출한다.(시작번호 : 0)
* loc[행, 열] 접근

### DataFrame.loc[ ]

In [44]:
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [45]:
# team_df.loc[행선택, 열선택]
team_df.loc[:, "apple":"catanddog"]

   apple  gildong  catanddog
0   4000     2000       7000
1   5000     2500       5000
2   6000     3000       3000
3   5500     4000       5000
4   4500     3000       4000

In [48]:
# team_df.loc[행선택, 열선택]
team_df.loc[[0, 2, 4], ["toto", "gildong"]]

   toto  gildong
0  1500     2000
2  5000     3000
4  5500     3000

In [53]:
# team_df.loc[행선택, 열선택]
team_df.loc[:, ["gildong"]]

   gildong
0     2000
1     2500
2     3000
3     4000
4     3000

In [54]:
# team_df.loc[행선택, 열선택]
team_df.loc[:, "gildong":"catanddog"]

   gildong  catanddog
0     2000       7000
1     2500       5000
2     3000       3000
3     4000       5000
4     3000       4000

In [56]:
# team_df.loc[행선택, 열선택]
team_df.loc[:, ["gildong", "catanddog"]]

   gildong  catanddog
0     2000       7000
1     2500       5000
2     3000       3000
3     4000       5000
4     3000       4000

In [57]:
# team_df.loc[행선택, 열선택]
team_df.loc[1:3, "toto" : "gildong"]

   toto  apple  gildong
1  3000   5000     2500
2  5000   6000     3000
3  7000   5500     4000

In [58]:
# team_df.loc[행선택, 열선택]
# 1행, 3행 선택하기
team_df.loc[[1, 3], :]

   toto  apple  gildong  catanddog
1  3000   5000     2500       5000
3  7000   5500     4000       5000

In [62]:
# team_df.loc[행선택, 열선택]
# apple, catanddog 선택
team_df.loc[:, ["apple", "catanddog"]]

   apple  catanddog
0   4000       7000
1   5000       5000
2   6000       3000
3   5500       5000
4   4500       4000

In [66]:
# team_df.loc[행선택, 열선택]
# 1, 3행, apple, catanddog 선택
team_df.loc[[2, 4], ["apple", "catanddog"]]

   apple  catanddog
2   6000       3000
4   4500       4000

In [67]:
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [68]:
# apple, gildong, catanddog의 2, 3행 선택
team_df.loc[2 : 3, "apple" : "catanddog"]

   apple  gildong  catanddog
2   6000     3000       3000
3   5500     4000       5000

In [70]:
# apple, gildong, catanddog의 2, 3행 선택
# catanddog가 마지막 column이기 때문에 생략 가능
team_df.loc[2 : 3, "apple" :]

   apple  gildong  catanddog
2   6000     3000       3000
3   5500     4000       5000

### DataFrame.iloc[ ]

In [72]:
# 전체 선택
team_df.iloc[ : , : ]

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [74]:
# 0행 선택
team_df.iloc[[0], :]

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000

In [78]:
# 2, 3, 4행 toto 선택
team_df.iloc[2 : 5, 0 : 1]

   toto
2  5000
3  7000
4  5500

In [80]:
# 2, 3, 4행 toto 선택
team_df.iloc[[2, 3, 4], 0 : 1]

   toto
2  5000
3  7000
4  5500

In [82]:
# apple, gildong의 1 ~ 4행 선택
team_df.iloc[1 : 5, 1 : 3]

   apple  gildong
1   5000     2500
2   6000     3000
3   5500     4000
4   4500     3000

In [84]:
# apple, gildong, catanddog 열 선택
team_df.iloc[:, 1:]

   apple  gildong  catanddog
0   4000     2000       7000
1   5000     2500       5000
2   6000     3000       3000
3   5500     4000       5000
4   4500     3000       4000

In [86]:
# apple, gildong 열의 0 ~ 2 행 선택
team_df.iloc[0 : 3, 1 : 3]

   apple  gildong
0   4000     2000
1   5000     2500
2   6000     3000

In [88]:
# apple, catanddog 열의 1 ~ 3행 선택
team_df.iloc[1 : 4, [1, 3]]

   apple  catanddog
1   5000       5000
2   6000       3000
3   5500       5000

In [89]:
# toto, apple 열의 1 ~ 3행 선택
team_df.iloc[1 : 4, 0 : 2]

   toto  apple
1  3000   5000
2  5000   6000
3  7000   5500

In [91]:
# toto, catanddog 열의 1, 2행 선택
team_df.iloc[1 : 3, [1, 3]]

   apple  catanddog
1   5000       5000
2   6000       3000

In [95]:
# toto, catanddog 열의 1, 2행 선택
team_df.iloc[1 : 3, 1 : 4: 2]

   apple  catanddog
1   5000       5000
2   6000       3000

In [96]:
idx_date = pd.date_range(start="2020-01-01",end="2020-01-05").tolist()
team_df.index = idx_date
team_df

            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000
2020-01-04  7000   5500     4000       5000
2020-01-05  5500   4500     3000       4000

In [97]:
team_df.iloc[[0, 1, 2], :]

            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000

In [99]:
team_df.loc['2020-01-01':'2020-01-03', :]

            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000

In [100]:
team_df.iloc[0:3, :]

            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000

In [101]:
idx_date = pd.date_range(start="2019-05-01",end="2019-05-05").tolist()
team_df.index = idx_date
team_df

            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

In [102]:
print(team_df.loc[ '2019-05-02' ] ) # 19-05-02 일
print("-----------")
print(team_df.loc[ ['2019-05-02', '2019-05-03'] ]) # 5월 2일, 3일 
print("-----------")
print(team_df.loc[ '2019-05-02': ])  # 5월 2일 이후 전체 데이터 가져오기

toto         3000
apple        5000
gildong      2500
catanddog    5000
Name: 2019-05-02 00:00:00, dtype: int64
-----------
            toto  apple  gildong  catanddog
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
-----------
            toto  apple  gildong  catanddog
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

### loc를 이용한 열에 접근

In [104]:
## 컬럼명 확인 
print(team_df.columns)
print("-----")
print(team_df.loc[:, 'toto'])   # 전체행, toto팀 
print("-----")
print(team_df.loc[:, ['toto', 'gildong'] ])   # 전체행, toto, gildong팀
print("-----")
print(team_df.loc[:, 'toto': ])   # 전체행, toto 부터 끝까지

Index(['toto', 'apple', 'gildong', 'catanddog'], dtype='object')
-----
2019-05-01    1500
2019-05-02    3000
2019-05-03    5000
2019-05-04    7000
2019-05-05    5500
Name: toto, dtype: int64
-----
            toto  gildong
2019-05-01  1500     2000
2019-05-02  3000     2500
2019-05-03  5000     3000
2019-05-04  7000     4000
2019-05-05  5500     3000
-----
            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

### iloc 속성을 이용한 행, 열 데이터 접근하기

In [105]:
print(team_df.iloc[0])      # 첫번째 행 접근
print("------")
print(team_df.iloc[ [0,1] ])  # 첫번째 두번째 행 접근
print("------")
print(team_df.iloc[ 0:3:1] )  # 첫번째부터 세번째 행 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[ range_num ] )  # 첫번째부터 세번째 행 접근

toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 2019-05-01 00:00:00, dtype: int64
------
            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
------
            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
------
            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000

In [106]:
print(team_df.iloc[0])
print(type(team_df.iloc[0]))

toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 2019-05-01 00:00:00, dtype: int64
<class 'pandas.core.series.Series'>

In [108]:
print(team_df.iloc[1 : 2, :])

            toto  apple  gildong  catanddog
2019-05-02  3000   5000     2500       5000

### 일반 통계
* 합
* 평균
* 표준편차
* 기타..

In [112]:
# 합 : .sum()
print(team_df.sum())
print(team_df.sum(axis = 0)) # axis = 0(index 합), 1(column 합)
print(team_df.sum(axis = 1))

toto         22000
apple        25000
gildong      14500
catanddog    24000
dtype: int64
toto         22000
apple        25000
gildong      14500
catanddog    24000
dtype: int64
2019-05-01    14500
2019-05-02    15500
2019-05-03    17000
2019-05-04    21500
2019-05-05    17000
dtype: int64

### 실습 4-2 통계량 구하기

In [117]:
# 평균 : mean()
team_df.mean()

toto         4400.0
apple        5000.0
gildong      2900.0
catanddog    4800.0
dtype: float64

In [119]:
# 표준편차 : std()
team_df.std()

toto         2162.174831
apple         790.569415
gildong       741.619849
catanddog    1483.239697
dtype: float64

In [118]:
# 요약값 : describe()
team_df.describe()

              toto        apple      gildong    catanddog
count     5.000000     5.000000     5.000000     5.000000
mean   4400.000000  5000.000000  2900.000000  4800.000000
std    2162.174831   790.569415   741.619849  1483.239697
min    1500.000000  4000.000000  2000.000000  3000.000000
25%    3000.000000  4500.000000  2500.000000  4000.000000
50%    5000.000000  5000.000000  3000.000000  5000.000000
75%    5500.000000  5500.000000  3000.000000  5000.000000
max    7000.000000  6000.000000  4000.000000  7000.000000

In [124]:
# 표준편차, 분산, 최대값, 최소값, 중앙값, 누적통계, 컬럼별 개수
print(team_df.std(), end = "\n\n")
print(team_df.var(), end = "\n\n")
print(team_df.max(), end = "\n\n")
print(team_df.min(), end = "\n\n")
print(team_df.median(), end = "\n\n")
print(team_df.cumsum(), end = "\n\n")
print(team_df.count(), end = "\n\n")

toto         2162.174831
apple         790.569415
gildong       741.619849
catanddog    1483.239697
dtype: float64

toto         4675000.0
apple         625000.0
gildong       550000.0
catanddog    2200000.0
dtype: float64

toto         7000
apple        6000
gildong      4000
catanddog    7000
dtype: int64

toto         1500
apple        4000
gildong      2000
catanddog    3000
dtype: int64

toto         5000.0
apple        5000.0
gildong      3000.0
catanddog    5000.0
dtype: float64

             toto  apple  gildong  catanddog
2019-05-01   1500   4000     2000       7000
2019-05-02   4500   9000     4500      12000
2019-05-03   9500  15000     7500      15000
2019-05-04  16500  20500    11500      20000
2019-05-05  22000  25000    14500      24000

toto         5
apple        5
gildong      5
catanddog    5
dtype: int64

In [126]:
# toto 열의 합
team_df['toto'].sum()

22000

In [132]:
# toto, apple 열의 합
team_df[["toto", "apple"]].sum()

toto     22000
apple    25000
dtype: int64

In [127]:
team_df.count()

toto         5
apple        5
gildong      5
catanddog    5
dtype: int64

In [129]:
team_df.count().index

Index(['toto', 'apple', 'gildong', 'catanddog'], dtype='object')

In [130]:
team_df.count().values

array([5, 5, 5, 5])

### apple과 catanddog의 sum(), mean(), std()

In [140]:
print(team_df[["apple", "catanddog"]].sum(), end = "\n\n")
print(team_df[["apple", "catanddog"]].mean(), end = "\n\n")
print(team_df[["apple", "catanddog"]].std(), end = "\n\n")

apple        25000
catanddog    24000
dtype: int64

apple        5000.0
catanddog    4800.0
dtype: float64

apple         790.569415
catanddog    1483.239697
dtype: float64

### team_df의 sum()을 구하고 기존의 team_df에 추가해 보자.

In [145]:
team_df["row_sum"] = team_df.sum(axis = 1)
team_df

   toto  apple  gildong  catanddog  row_sum
0  1500   4000     2000       7000    14500
1  3000   5000     2500       5000    15500
2  5000   6000     3000       3000    17000
3  7000   5500     4000       5000    21500
4  5500   4500     3000       4000    17000

### Titanic 데이터 셋으로 요약 보고서 작성

In [146]:
import seaborn as sns

t = sns.load_dataset("titanic")
t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

* t.columns : 컬럼명 확인
* t.shape : 행과 열 확인
* t.describe() : 통계량 확인
* t.head() : 앞의 5행 보기
* t.tail() : 뒤의 5행 보기

In [148]:
t.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [149]:
team_df

   toto  apple  gildong  catanddog  row_sum
0  1500   4000     2000       7000    14500
1  3000   5000     2500       5000    15500
2  5000   6000     3000       3000    17000
3  7000   5500     4000       5000    21500
4  5500   4500     3000       4000    17000

In [150]:
team_df.columns

Index(['toto', 'apple', 'gildong', 'catanddog', 'row_sum'], dtype='object')

In [151]:
team_df.shape

(5, 5)

In [153]:
team_df.sort_values("row_sum", ascending = False)

   toto  apple  gildong  catanddog  row_sum
3  7000   5500     4000       5000    21500
2  5000   6000     3000       3000    17000
4  5500   4500     3000       4000    17000
1  3000   5000     2500       5000    15500
0  1500   4000     2000       7000    14500

In [157]:
team_df["row_mean"] = team_df.iloc[:, 0:4].mean(axis = 1)

In [163]:
team_df.row_mean.sort_values(ascending = False)
team_df

   toto  apple  gildong  catanddog  row_sum  row_mean
0  1500   4000     2000       7000    14500    3625.0
1  3000   5000     2500       5000    15500    3875.0
2  5000   6000     3000       3000    17000    4250.0
3  7000   5500     4000       5000    21500    5375.0
4  5500   4500     3000       4000    17000    4250.0

In [164]:
team_df.sort_values("row_mean", ascending = False)

   toto  apple  gildong  catanddog  row_sum  row_mean
3  7000   5500     4000       5000    21500    5375.0
2  5000   6000     3000       3000    17000    4250.0
4  5500   4500     3000       4000    17000    4250.0
1  3000   5000     2500       5000    15500    3875.0
0  1500   4000     2000       7000    14500    3625.0

In [165]:
# 자료형 - Series, DataFrame
# 행과 열을 선택 - loc, iloc
# date_range()
# 새로운 열을 추가 : __["새로운 컬럼명"] = ___
# 통계량 구하기 : [].sum(), mean(), std() 
# axis = 0(각 열의 최종합, 행들의 합)
# axis = 1(행의 합, column들의 합)
# 값을 정렬 sort_values()

In [166]:
team_df

   toto  apple  gildong  catanddog  row_sum  row_mean
0  1500   4000     2000       7000    14500    3625.0
1  3000   5000     2500       5000    15500    3875.0
2  5000   6000     3000       3000    17000    4250.0
3  7000   5500     4000       5000    21500    5375.0
4  5500   4500     3000       4000    17000    4250.0

### 행의 합이 15000 이상인 값 찾기
* 조건을 걸어 데이터 찾기

In [167]:
team_df[team_df.row_sum >= 15000]

   toto  apple  gildong  catanddog  row_sum  row_mean
1  3000   5000     2500       5000    15500    3875.0
2  5000   6000     3000       3000    17000    4250.0
3  7000   5500     4000       5000    21500    5375.0
4  5500   4500     3000       4000    17000    4250.0

In [168]:
team_df.loc[team_df.row_sum >= 15000, :]

   toto  apple  gildong  catanddog  row_sum  row_mean
1  3000   5000     2500       5000    15500    3875.0
2  5000   6000     3000       3000    17000    4250.0
3  7000   5500     4000       5000    21500    5375.0
4  5500   4500     3000       4000    17000    4250.0

* 조건을 2개를 걸어 데이터 찾기
    * 행의 합이 15000 이상, 행의 평균이 4000 이상인 값 찾기

In [176]:
team_df.loc[(team_df.row_sum >= 15000) & (team_df.row_mean >= 4000), :]

   toto  apple  gildong  catanddog  row_sum  row_mean
2  5000   6000     3000       3000    17000    4250.0
3  7000   5500     4000       5000    21500    5375.0
4  5500   4500     3000       4000    17000    4250.0